GetReferences Method
 Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public IList<Reference> GetReferences(
	FamilyInstanceReferenceType referenceType
)
Visual Basic
Public Function GetReferences ( _
	referenceType As FamilyInstanceReferenceType _
) As IList(Of Reference)
Visual C++
public:
IList<Reference^>^ GetReferences(
	FamilyInstanceReferenceType referenceType
)
Parameters
referenceType
Type: Autodesk.Revit.DBFamilyInstanceReferenceType
 The family reference type.
Return Value
 Returns all the family instance references corresponding to reference planes and reference lines of the given reference type. Returns null if there are no family instance references of the given reference type, or if the input reference type is FamilyInstanceReferenceType.NotAReference.
Remarks
 Reference planes from the instance's family that have their "Is Reference" property set to "Not a Reference" do not create references in the family instance.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →